Статистика работы механизмов/Конфигурация/DataProcessors/_ТестированиеSPPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ТестированиеSPPI</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВыгрузкиВExcel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресаЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерОписанияТабличногоДокумента</Name>
							<Comment>Номер строки ТЧ "ОписанияТабличныхДокументов"</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КритерийТестирования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КритерииТестированияSPPI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКритерияТестирования</Name>
							<Comment>Номер строки ТЧ "КритерииТестирования"</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ОтветыТестированияSPPI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КритерииТестирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КритерииТестированияSPPI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловияДоговора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписанияТабличныхДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАктива</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомераДокументов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомераДоговоров</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокументов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическихДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочихДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговыхДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеВыпуска</Name>
							<Comment>Для типов: "Облигации"</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаНоминала</Name>
							<Comment>Для типов: "Облигации"</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРегистрации</Name>
							<Comment>Для типов: "Облигации"</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЭмиссии</Name>
							<Comment>Для типов: "Облигации"</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеСтавокКупонов</Name>
							<Comment>Для типов: "Облигации"</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОфертыИлиПогашения</Name>
							<Comment>Для типов: "Облигации"</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодичностьВыплатыКупона</Name>
							<Comment>Для типов: "Облигации", в днях</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодичностьВыплат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПериодичностиВыплатыПроцентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВозвратаДепозитаПоТребованиюКлиента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПодтверждения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГлавныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаДоверительногоУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыВТабличныхДокументах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерОписанияТабличногоДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
								<v8:Type>cfg:DocumentRef.МНО</v8:Type>
								<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ТестированиеSPPI/Forms/ФормаРедактированияОтветов/Ext/Form/Module.bsl
#Область ОписаниеФормы
// Параметры формы:
//	Организация - СправочникСсылка.Организации,
//	СчетДоверительногоУправления - СправочникСсылка.СчетаДоверительногоУправления,
//	Дата - Дата,
//	МассивОбъектов - Массив(СправочникСсылка.Облигации / ДокументСсылка.СделкаРЕПО / ДокументСсылка.МНО / СправочникСсылка.ДепозитныеВклады),
//	КоллекцияОтветов - Массив(Структура(
//		КритерийТестирования,
//		НомерКритерияТестирования,
//		Порядок,
//		УсловияДоговора,
//		ОписаниеПорядок,
//		Ответ
//	))
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Параметр "Организация"
	Если Не ЗначениеЗаполнено(Параметры.Организация) Тогда
		Сообщить("Параметр ""Организация"" не заполнен.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Организация = Параметры.Организация;
	// Параметр "СчетДоверительногоУправления"
	Если Не ЗначениеЗаполнено(Параметры.СчетДоверительногоУправления) Тогда
		Сообщить("Параметр ""СчетДоверительногоУправления"" не заполнен.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	СчетДоверительногоУправления = Параметры.СчетДоверительногоУправления;
	// Параметр "Дата"
	Если Не ЗначениеЗаполнено(Параметры.Дата) Тогда
		Сообщить("Параметр ""Дата"" не заполнен.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Дата = Параметры.Дата;
	// Параметр "МассивОбъектов"
	Если ТипЗнч(Параметры.МассивОбъектов) <> Тип("Массив")
		Или Параметры.МассивОбъектов.Количество() = 0
		Или Не ЗначениеЗаполнено(Параметры.МассивОбъектов[0])
	Тогда
		Сообщить("Параметр ""МассивОбъектов"" не заполнен.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Для Каждого ЭлементОбъектов Из Параметры.МассивОбъектов Цикл
		Объекты.Добавить(ЭлементОбъектов);
	КонецЦикла;
	// Параметр "КоллекцияОтветов"
	Если ТипЗнч(Параметры.КоллекцияОтветов) <> Тип("Массив")
		Или Параметры.КоллекцияОтветов.Количество() = 0
		Или Не ЗначениеЗаполнено(Параметры.КоллекцияОтветов[0])
	Тогда
		Сообщить("Параметр ""КоллекцияОтветов"" не заполнен.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	РезультатТестирования = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.Нет");
	ТекущийПриоритетОтветов = 0; // 0 - "Нет", 1 - "ВопросКОбсуждению", 2 - "Да"
	Для Каждого СтрокаМассива Из Параметры.КоллекцияОтветов Цикл
		НоваяСтрокаКоллекции = КоллекцияОтветов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаКоллекции, СтрокаМассива);
		Если СтрокаМассива.Ответ = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.Нет") Тогда
			НоваяСтрокаКоллекции.ПометкаНет = Истина;
		ИначеЕсли СтрокаМассива.Ответ = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.ВопросКОбсуждению") Тогда
			НоваяСтрокаКоллекции.ПометкаВопросКОбсуждению = Истина;
			Если ТекущийПриоритетОтветов < 1 Тогда
				РезультатТестирования = СтрокаМассива.Ответ;
				ТекущийПриоритетОтветов = 1;
			КонецЕсли;
		ИначеЕсли СтрокаМассива.Ответ = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.Да") Тогда
			НоваяСтрокаКоллекции.ПометкаДа = Истина;
			Если ТекущийПриоритетОтветов < 2 Тогда
				РезультатТестирования = СтрокаМассива.Ответ;
				ТекущийПриоритетОтветов = 2;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// Параметр "НаименованиеТабличногоДокумента"
	Если Не ЗначениеЗаполнено(Параметры.НаименованиеТабличногоДокумента) Тогда
		Сообщить("Параметр ""НаименованиеТабличногоДокумента"" не заполнен.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	НаименованиеТабличногоДокумента = Параметры.НаименованиеТабличногоДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЭтаФорма.Модифицированность Тогда
		Отказ = Истина; // Асинхронные обработчики должны устанавливать свои параметры перед запуском асинхронных функций
		ПередЗакрытиемАсинх();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПередЗакрытиемАсинх()
	Ответ = Ждать ВопросАсинх("Данные были изменены. Применить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		КомандаЗаписатьИЗакрыть(Неопределено);
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ЭтаФорма.Модифицированность = Ложь;
		Закрыть();
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КоллекцияОтветовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КоллекцияОтветовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КоллекцияОтветовДляДепозитовПометкаДаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.КоллекцияОтветовДляДепозитов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекущиеДанные.ПометкаДа Тогда
		ТекущиеДанные.ПометкаНет = Ложь;
		ТекущиеДанные.ПометкаВопросКОбсуждению = Ложь;
	ИначеЕсли Не (ТекущиеДанные.ПометкаДа И ТекущиеДанные.ПометкаНет И ТекущиеДанные.ПометкаВопросКОбсуждению) Тогда
		ТекущиеДанные.ПометкаДа = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоллекцияОтветовДляДепозитовПометкаНетПриИзменении(Элемент)
	ТекущиеДанные = Элементы.КоллекцияОтветовДляДепозитов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекущиеДанные.ПометкаНет Тогда
		ТекущиеДанные.ПометкаДа = Ложь;
		ТекущиеДанные.ПометкаВопросКОбсуждению = Ложь;
	ИначеЕсли Не (ТекущиеДанные.ПометкаДа И ТекущиеДанные.ПометкаНет И ТекущиеДанные.ПометкаВопросКОбсуждению) Тогда
		ТекущиеДанные.ПометкаНет = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоллекцияОтветовДляДепозитовПометкаВопросКОбсуждениюПриИзменении(Элемент)
	ТекущиеДанные = Элементы.КоллекцияОтветовДляДепозитов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекущиеДанные.ПометкаВопросКОбсуждению Тогда
		ТекущиеДанные.ПометкаДа = Ложь;
		ТекущиеДанные.ПометкаНет = Ложь;
	ИначеЕсли Не (ТекущиеДанные.ПометкаДа И ТекущиеДанные.ПометкаНет И ТекущиеДанные.ПометкаВопросКОбсуждению) Тогда
		ТекущиеДанные.ПометкаВопросКОбсуждению = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоллекцияОтветовДляДепозитовПриИзменении(Элемент)
	// Перерасчёт результата тестирования
	РезультатТестирования = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.Нет");
	ТекущийПриоритетОтветов = 0; // 0 - "Нет", 1 - "ВопросКОбсуждению", 2 - "Да"
	Для Каждого СтрокаОтветов Из КоллекцияОтветов Цикл
		Если СтрокаОтветов.ПометкаВопросКОбсуждению Тогда
			Если ТекущийПриоритетОтветов < 1 Тогда
				РезультатТестирования = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.ВопросКОбсуждению");
				ТекущийПриоритетОтветов = 1;
			КонецЕсли;
		ИначеЕсли СтрокаОтветов.ПометкаДа Тогда
			Если ТекущийПриоритетОтветов < 2 Тогда
				РезультатТестирования = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.Да");
				ТекущийПриоритетОтветов = 2;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	ЭтаФорма.Модифицированность = Ложь;
	МассивОтветов = Новый Массив;
	Для Каждого СтрокаКоллекции Из КоллекцияОтветов Цикл
		НовыйЭлементМассива = Новый Структура("Порядок, КритерийТестирования, НомерКритерияТестирования, УсловияДоговора, Описание, Ответ");
		ЗаполнитьЗначенияСвойств(НовыйЭлементМассива, СтрокаКоллекции);
		Если СтрокаКоллекции.ПометкаДа Тогда
			НовыйЭлементМассива.Ответ = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.Да");
		ИначеЕсли СтрокаКоллекции.ПометкаНет Тогда
			НовыйЭлементМассива.Ответ = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.Нет");
		ИначеЕсли СтрокаКоллекции.ПометкаВопросКОбсуждению Тогда
			НовыйЭлементМассива.Ответ = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.ВопросКОбсуждению");
		КонецЕсли;
		МассивОтветов.Добавить(НовыйЭлементМассива);
	КонецЦикла;
	КомандаЗаписатьИЗакрытьНаСервере(МассивОтветов);
	Закрыть(МассивОтветов);
КонецПроцедуры

&НаСервере
Процедура КомандаЗаписатьИЗакрытьНаСервере(МассивОтветов)
	Если ПараметрыСеанса.ТекущаяОрганизация <> Организация Тогда
		Сообщить("Текущая организация не соответствует редактируемым данным!");
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(Организация) Тогда
		Сообщить("Не указана организация.");
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(СчетДоверительногоУправления) Тогда
		Сообщить("Не указан счёт Д/У.");
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(Дата) Тогда
		Сообщить("Не указана дата.");
		Возврат;
	КонецЕсли;
	
	// Помещение ответов в хранилище значения
	ОтветыПоКритериям = Новый ТаблицаЗначений;
	ОтветыПоКритериям.Колонки.Добавить("КритерийТестирования", Новый ОписаниеТипов("СправочникСсылка.КритерииТестированияSPPI"));
	ОтветыПоКритериям.Колонки.Добавить("Ответ", Новый ОписаниеТипов("ПеречислениеСсылка.ОтветыТестированияSPPI"));
	Для Каждого СтрокаОтветов Из МассивОтветов Цикл
		СтрокаОтветовПоКритериям = ОтветыПоКритериям.Добавить();
		СтрокаОтветовПоКритериям.КритерийТестирования = СтрокаОтветов.КритерийТестирования;
		СтрокаОтветовПоКритериям.Ответ = СтрокаОтветов.Ответ;
	КонецЦикла;
	ОтветыПоКритериямВХранилище = Новый ХранилищеЗначения(ОтветыПоКритериям);
	
	// Запись данных в базу
	НаборЗаписей = РегистрыСведений.ТестированияSPPI.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.СчетДоверительногоУправления.Установить(СчетДоверительногоУправления);
	НаборЗаписей.Отбор.Дата.Установить(Дата);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	Для Каждого СтрокаЦенныхБумаг Из Объекты Цикл
		СтрокаНабораЗаписей = НаборЗаписей.Добавить();
		СтрокаНабораЗаписей.Организация = Организация;
		СтрокаНабораЗаписей.СчетДоверительногоУправления = СчетДоверительногоУправления;
		СтрокаНабораЗаписей.Дата = Дата;
		СтрокаНабораЗаписей.Объект = СтрокаЦенныхБумаг.Значение;
		СтрокаНабораЗаписей.РезультатТестирования = РезультатТестирования;
		СтрокаНабораЗаписей.НаименованиеТабличногоДокумента = НаименованиеТабличногоДокумента;
		СтрокаНабораЗаписей.ОтветыПоКритериям = ОтветыПоКритериямВХранилище;
		СтрокаНабораЗаписей.ДатаТестирования = ТекущаяДата();
		СтрокаНабораЗаписей.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

#КонецОбласти
